
public class array_ran {

	public static void main(String[] args) {
		System.out.println("테스트");
//		0~100까지 임의의 수를 30개 발생시켜서 배열에 넣은 후 정렬하시오.
//
//		조건1) 정렬 전/후의 값을 화면에 출력
//		조건2) 소트 알고리즘 중 사용한 알고리즘을 설명한 레포트 (형식 무관, 내용만 제출) 첨부
//		비고. 정렬 알고리즘 및 이중 루프문에 대한 공부는 따로 하셔야 합니다.
//		(서로간의 정보 교환 가능)
//
//
//		사용자에게 9개의 숫자를 입력받아서 3*3의 이중 배열에 넣은 후 각행의 덧셈 합을
//		출력하시오.
//
//		조건1) 출력 시 4*4의 형식으로 출력 (4행째는 덧셈 합)
//		조건2) 데이터 출력시 정렬된 형식으로 출력
//
//		비고. 이중배열 사용법 int[][] arr = new int[4][4];
//		비고. 데이터를 정렬된 형식으로 출력하는 방법을 찾아보시오.

	}

}
